import React from "react";
import Waypoint from "./waypoint";

const AboutUs: React.FC = () => {
  return (
    <section className="flex flex-col bg-white py-20 text-3xl md:text-4xl">
      <div className="container mx-auto px-11">
        <p>
          <strong className="leading-tight max-w-5xl mx-auto text-4xl lg:text-4xl ">
            РАБОТАЕМ В СФЕРЕ ЭКСПОРТА И ИМПОРТА С 2008 ГОДА{" "}
          </strong>
          В компании есть «стабильные» направления работы, деятельность по
          которым ведется беспрерывно, невзирая на постоянные изменения в связи
          с закрытием границ в пандемию, санкций, скачков курса и прочих
          конъюнктурных влияний.
        </p>
      </div>
      <div className="container mx-auto px-11 text-center mt-28">
        <h2>РЕШЕНИЕ - РАБОТА ЧЕРЕЗ АГЕНТА</h2>
        <div className="mt-10 grid grid-cols-2 md:grid-cols-3 gap-6 lg:gap-20">
          <Waypoint
            label="Производитель КНР"
            detail="Заключение контракта, валютные платежи. 2-3 дня"
          >
            <svg
              viewBox="0 0 640 512"
              xmlns="http://www.w3.org/2000/svg"
              className="w-32 h-32"
            >
              <path d="M506.1 127.1c-17.97-20.17-61.46-61.65-122.7-71.1c-22.5-3.354-45.39 3.606-63.41 18.21C302 60.47 279.1 53.42 256.5 56.86C176.8 69.17 126.7 136.2 124.6 139.1c-7.844 10.69-5.531 25.72 5.125 33.57c4.281 3.157 9.281 4.657 14.19 4.657c7.406 0 14.69-3.375 19.38-9.782c.4062-.5626 40.19-53.91 100.5-63.23c7.457-.9611 14.98 .67 21.56 4.483L227.2 168.2C214.8 180.5 207.1 196.1 207.1 214.5c0 17.5 6.812 33.94 19.16 46.29C239.5 273.2 255.9 279.1 273.4 279.1s33.94-6.813 46.31-19.19l11.35-11.35l124.2 100.9c2.312 1.875 2.656 5.251 .5 7.97l-27.69 35.75c-1.844 2.25-5.25 2.594-7.156 1.063l-22.22-18.69l-26.19 27.75c-2.344 2.875-5.344 3.563-6.906 3.719c-1.656 .1562-4.562 .125-6.812-1.719l-32.41-27.66L310.7 392.3l-2.812 2.938c-5.844 7.157-14.09 11.66-23.28 12.6c-9.469 .8126-18.25-1.75-24.5-6.782L170.3 319.8H96V128.3L0 128.3v255.6l64 .0404c11.74 0 21.57-6.706 27.14-16.14h60.64l77.06 69.66C243.7 449.6 261.9 456 280.8 456c2.875 0 5.781-.125 8.656-.4376c13.62-1.406 26.41-6.063 37.47-13.5l.9062 .8126c12.03 9.876 27.28 14.41 42.69 12.78c13.19-1.375 25.28-7.032 33.91-15.35c21.09 8.188 46.09 2.344 61.25-16.47l27.69-35.75c18.47-22.82 14.97-56.48-7.844-75.01l-120.3-97.76l8.381-8.382c9.375-9.376 9.375-24.57 0-33.94c-9.375-9.376-24.56-9.376-33.94 0L285.8 226.8C279.2 233.5 267.7 233.5 261.1 226.8c-3.312-3.282-5.125-7.657-5.125-12.31c0-4.688 1.812-9.064 5.281-12.53l85.91-87.64c7.812-7.845 18.53-11.75 28.94-10.03c59.75 9.22 100.2 62.73 100.6 63.29c3.088 4.155 7.264 6.946 11.84 8.376H544v175.1c0 17.67 14.33 32.05 31.1 32.05L640 384V128.1L506.1 127.1zM48 352c-8.75 0-16-7.245-16-15.99c0-8.876 7.25-15.99 16-15.99S64 327.2 64 336.1C64 344.8 56.75 352 48 352zM592 352c-8.75 0-16-7.245-16-15.99c0-8.876 7.25-15.99 16-15.99s16 7.117 16 15.99C608 344.8 600.8 352 592 352z" />
            </svg>
          </Waypoint>
          <Waypoint
            label="Склад"
            detail="Склад на балансе нашей китайской компании. Приемка/перегрузка/хранение. 2-3 дня"
          >
            <svg
              version="1.1"
              viewBox="0 0 24 24"
              xmlSpace="preserve"
              xmlns="http://www.w3.org/2000/svg"
              xmlnsXlink="http://www.w3.org/1999/xlink"
              className="w-32 h-32"
            >
              <g id="info" />
              <g id="icons">
                <g id="statistics">
                  <path d="M5,12H3c-1.1,0-2,0.9-2,2v6c0,1.1,0.9,2,2,2h2c1.1,0,2-0.9,2-2v-6C7,12.9,6.1,12,5,12z" />
                  <path d="M13,2h-2C9.9,2,9,2.9,9,4v16c0,1.1,0.9,2,2,2h2c1.1,0,2-0.9,2-2V4C15,2.9,14.1,2,13,2z" />
                  <path d="M21,8h-2c-1.1,0-2,0.9-2,2v10c0,1.1,0.9,2,2,2h2c1.1,0,2-0.9,2-2V10C23,8.9,22.1,8,21,8z" />
                </g>
              </g>
            </svg>
          </Waypoint>
          <Waypoint
            label="Склад клиента / Склад агента"
            detail="финишная линия"
          >
            <svg
              enableBackground="new 0 0 50 50"
              height="50px"
              id="Layer_1"
              version="1.1"
              viewBox="0 0 50 50"
              width="50px"
              xmlSpace="preserve"
              xmlns="http://www.w3.org/2000/svg"
              xmlnsXlink="http://www.w3.org/1999/xlink"
              className="w-32 h-32"
            >
              <rect fill="none" height="50" width="50" />
              <line
                fill="none"
                stroke="#000000"
                strokeLinecap="round"
                strokeLinejoin="round"
                strokeMiterlimit="10"
                strokeWidth="2"
                x1="18.594"
                x2="3.373"
                y1="47.92"
                y2="5.407"
              />
              <path
                d="  M4.448,8.409c0,0,5.911-6.409,16.179-6.409c6.25,0,9.106,4.073,14.264,4.073C40.046,6.073,44.998,2,44.998,2v26.471  c0,0-3.723,2.037-8.146,2.037c-4.421,0-6.225-2.037-12.217-2.037c-5.683,0-11.025,5.516-11.025,5.516L4.448,8.409z"
                fill="none"
                stroke="#000000"
                strokeLinecap="round"
                strokeLinejoin="round"
                strokeMiterlimit="10"
                strokeWidth="2"
              />
              <path d="M4.448,8.409c0,0,3.067-3.248,7.207-4.584l3.164,8.124c0,0-4.086,1.47-7.422,4.605L4.553,8.709" />
              <path d="M14.819,11.949l3.412,8.759c0,0,2.683-0.954,4.53-0.954s3.678,0.271,3.678,0.271l-2.477-9.315c0,0-0.7-0.099-1.563-0.099  C18.264,10.611,14.819,11.949,14.819,11.949z" />
              <path d="M10.72,25.776l2.89,8.21c0,0,3.997-3.832,7.804-4.91l-3.182-8.368C14.566,22.12,10.72,25.776,10.72,25.776z" />
              <path d="M21.676,2.111l2.287,8.598c1.85,0,6.994,2.521,6.994,2.521l-2.028-8.879C27.766,3.916,24.721,2.255,21.676,2.111z" />
              <path d="M26.439,20.024l2.355,8.851c1.186,0,4.586,1.449,6.065,1.449l-1.988-8.702C30.957,21.124,27.859,20.223,26.439,20.024z" />
              <path d="M30.957,13.231l1.915,8.392c0,0,1.916,0.354,3.231,0.354c1.314,0,2.953-0.298,2.953-0.298l-0.622-7.684  c0,0-1.269,0.394-2.807,0.394C33.225,14.389,30.957,13.231,30.957,13.231z" />
              <path d="M37.762,5.671l0.673,8.323c0,0,3.129-0.786,6.565-3.384L44.998,2C41.053,5.022,37.762,5.671,37.762,5.671z" />
              <path d="M39.057,21.679c0,0,3.014-0.559,5.941-2.259v9.051c-3.117,1.496-5.261,1.767-5.261,1.767L39.057,21.679z" />
            </svg>
          </Waypoint>
        </div>
      </div>
    </section>
  );
};

export default AboutUs;
